# "Learn Python for Data Science" Course from [Analytics Vidhya](https://courses.analyticsvidhya.com/courses/introduction-to-data-science?utm_source=blog&utm_medium=Comprehensive-learning-path-ds-python-page)

### Some Shortcut for Jupyternotebook
A to insert a new cell above the current cell, B to insert a new cell below.

M to change the current cell to Markdown, Y to change it back to code

D + D (press the key twice) to delete the current cell

## Operators, Constants, Variables

## Arithmetic Operators

In [5]:
# Addtion, Division, Multiplication, Subtraction
print (3+5, 35/7, 35*2, 35-8)

8 5.0 70 27

## Comparison Operators

In [6]:
print (45 > 34, 44 < 32, 43 == 43)

True False True

## Logical Operators

In [18]:
# and operator
## 0 is True, other number is True
## Check 1st number, if False then return 1st
## If True, then check next, and then return final
print (0 and 1, 3 and 0, 3 and 7, 7 and 3)

0 0 7 3

In [14]:
# or operator
## 0 is True, other number is True
## Check 1st number if True then return 1st
## If False, then check next, and then return final
print (0 or 3, 3 or 0, 3 or 7, 7 or 3)

3 3 3 7

## Variable Assignment and Rules
### Constants can be assigned to Variables
Python is case-sensitive

Variable name cannot start with special character excpet underscore (_)

Varaible name cannot start with a number

In [23]:
i = 5
print(i)
j = i
print(j)
j = 3
print(i, j)

5
5
5 3

In [27]:
_a = 3
_a

3

## Data Types
### int - integer numbers, float - decimal numbers, bool - boolean values, str - strings

In [33]:
a,b,c,d = 5,5.0,True,'as'
type(a),type(b),type(c),type(d)

(int, float, bool, str)

## Conditional Statements

if condition:

    statement 1

elif condition2:

    statement 2
else:

    statement 3

In [38]:
a = input()
a = int(a)
if a % 2 == 0:
    print ('Even')
elif a % 2 == 1:
    print ('Odd')
else:
    print ('Not a number')

4
Even

## Looping Constructs
for i in range(10,20):

    print (str(i) + " time!")

In [48]:
for i in range(2,6,2):
    print (i)

2
4

In [45]:
for i in '':
    print (str(i) + " time!")

## Functions
1. Re-usable piece of code
2. Created for solving specific problem
### Built-in Functions: print(), max(), range(), etc.
### User Defined Functions
def function_name(arguments):

    statement 1
    
    statement 2
    
    ......
    
    return statement

In [52]:
def squareroot(a):
    b = a ** 0.5
    return b
print(squareroot(10))

3.1622776601683795

## Data Structures
Data types will not always be used in all cases, then data structures (array) will help
### Tuples


### Lists
A list is an ordered data structure with elements separated by comma and enclosed within square brackets.

['a',1,'b',2]
### Dictionaries
If we do not want our data to be a sequence or want to access our data by names, enclosed key and value within braces.

{key: value}

{'a':1, 'b':2}

In [78]:
# List
x = [1,'a',2,'b']
## List sets index started from 0, same as string index
print(x[0])
print(x[1:3])
print(x[-1])

## Adding a single element
x.append(3)
x.append('c')
## Adding multiple elements
x.extend([4,'d'])
## Adding list to a list
x.append([5,'e'])

x.append(3)
print('x after adding new values ' + str(x))

## Deleting an element by value (only remove first value)
x.remove(3)
print('x after deleting by value ' + str(x))
## Deleting an element by index
del x[8]
print('x after deleting by index ' + str(x))

## Looping over a List
for i in x: print(i)
## List comprehension
[print(str(i)+' element') for i in x]
print(x)

1
['a', 2]
b
x after adding new values [1, 'a', 2, 'b', 3, 'c', 4, 'd', [5, 'e'], 3]
x after deleting by value [1, 'a', 2, 'b', 'c', 4, 'd', [5, 'e'], 3]
x after deleting by index [1, 'a', 2, 'b', 'c', 4, 'd', [5, 'e']]
1
a
2
b
c
4
d
[5, 'e']
1 element
a element
2 element
b element
c element
4 element
d element
[5, 'e'] element
[1, 'a', 2, 'b', 'c', 4, 'd', [5, 'e']]

In [89]:
## Dictionary
x = {'a':'1', 'b':2}
## Accessing element by keys rather than index
x['a'],x['b']

## Adding a single element to a Dictionary
x['c']=[3,1]
print(x)
## Adding multiple elements
x.update({'d':4,'e':[1,2,5]})
print(x)

## Deleting an element
del x['d']
print(x)

{'a': '1', 'b': 2, 'c': [3, 1]}
{'a': '1', 'b': 2, 'c': [3, 1], 'd': 4, 'e': [1, 2, 5]}
{'a': '1', 'b': 2, 'c': [3, 1], 'e': [1, 2, 5]}

## Standard Library
### Built-in functions
print(), max() etc.
### Built-in constants
True, False, None etc.
### Data types
int, float, bool, str
### File formats
csv, excel etc.
## Module
### functions included into pre-defined python file
import modulename

from modulename import functionname

from packagename import modulename

the difference between import and from...import can see below
[stackoverflow](https://stackoverflow.com/questions/9439480/from-import-vs-import)
## Package
### a collection of modules

## Pandas
#### 1.Reading different varieties of data.
#### 2.Functions for filtering, selecting and manipulating data
#### 3.Plotting data for visualization and exploration purpose.
[Pandas Doc](https://pandas.pydata.org/docs/)

In [9]:
import pandas as pd
df = pd.read_csv('/Users/tianwolf/Downloads/read_csv/data.csv')
df1 = pd.read_excel('/Users/tianwolf/Downloads/read_csv/data.xlsx')

In [22]:
print(df.head())
print(df.tail(10))
print(df1.head())

   PassengerId  Survived  Pclass  \
0            1         0       3
1            2         1       1
2            3         1       3
3            4         1       1
4            5         0       3

                                                Name     Sex   Age  SibSp  \
0                            Braund, Mr. Owen Harris    male  22.0      1
1  Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
2                             Heikkinen, Miss. Laina  female  26.0      0
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
4                           Allen, Mr. William Henry    male  35.0      0

   Parch            Ticket     Fare Cabin Embarked
0      0         A/5 21171   7.2500   NaN        S
1      0          PC 17599  71.2833   C85        C
2      0  STON/O2. 3101282   7.9250   NaN        S
3      0            113803  53.1000  C123        S
4      0            373450   8.0500   NaN        S
     PassengerId  Survived  Pclass                                      Name  \
881          882         0       3                        Markun, Mr. Johann
882          883         0       3              Dahlberg, Miss. Gerda Ulrika
883          884         0       2             Banfield, Mr. Frederick James
884          885         0       3                    Sutehall, Mr. Henry Jr
885          886         0       3      Rice, Mrs. William (Margaret Norton)
886          887         0       2                     Montvila, Rev. Juozas
887          888         1       1              Graham, Miss. Margaret Edith
888          889         0       3  Johnston, Miss. Catherine Helen "Carrie"
889          890         1       1                     Behr, Mr. Karl Howell
890          891         0       3                       Dooley, Mr. Patrick

        Sex   Age  SibSp  Parch            Ticket     Fare Cabin Embarked
881    male  33.0      0      0            349257   7.8958   NaN        S
882  female  22.0      0      0              7552  10.5167   NaN        S
883    male  28.0      0      0  C.A./SOTON 34068  10.5000   NaN        S
884    male  25.0      0      0   SOTON/OQ 392076   7.0500   NaN        S
885  female  39.0      0      5            382652  29.1250   NaN        Q
886    male  27.0      0      0            211536  13.0000   NaN        S
887  female  19.0      0      0            112053  30.0000   B42        S
888  female   NaN      1      2        W./C. 6607  23.4500   NaN        S
889    male  26.0      0      0            111369  30.0000  C148        C
890    male  32.0      0      0            370376   7.7500   NaN        Q
   PassengerId  Survived  Pclass  \
0            1         0       3
1            2         1       1
2            3         1       3
3            4         1       1
4            5         0       3

                                                Name     Sex   Age  SibSp  \
0                            Braund, Mr. Owen Harris    male  22.0      1
1  Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
2                             Heikkinen, Miss. Laina  female  26.0      0
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
4                           Allen, Mr. William Henry    male  35.0      0

   Parch            Ticket     Fare Cabin Embarked
0      0         A/5 21171   7.2500   NaN        S
1      0          PC 17599  71.2833   C85        C
2      0  STON/O2. 3101282   7.9250   NaN        S
3      0            113803  53.1000  C123        S
4      0            373450   8.0500   NaN        S

In [29]:
df.shape
df.columns
df.size
## Selection by Columns
df[['PassengerId','Survived','Pclass']]
## Selection by Rows
df.iloc[:10]
## Selection by Rows and Columns
df.iloc[:10,:2]
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [37]:
## Sort in Pandas
df.sort_values(by=['Sex','Age'], ascending=False, inplace=True)
df.sort_index(inplace=True)
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [35]:
df.iloc[:5]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
630,631,1,1,"Barkworth, Mr. Algernon Henry Wilson",male,80.0,0,0,27042,30.0000,A23,S
851,852,0,3,"Svensson, Mr. Johan",male,74.0,0,0,347060,7.7750,NaN,S
493,494,0,1,"Artagaveytia, Mr. Ramon",male,71.0,0,0,PC 17609,49.5042,NaN,C
96,97,0,1,"Goldschmidt, Mr. George B",male,71.0,0,0,PC 17754,34.6542,A5,C
116,117,0,3,"Connors, Mr. Patrick",male,70.5,0,0,370369,7.7500,NaN,Q

### DataFrame is similar to Excel spreadsheet table
Rows * Columns

Indexing




### Merging Dataframes
#### concat()
#### merge()

In [12]:
## Embedding customized pics
%%HTML
<iframe width="100%" height="100" src="pic/formula1.png"></iframe>

UsageError: Line magic function `%%HTML<iframe` not found.

In [25]:
import numpy as np

In [62]:
df1 = pd.DataFrame(
    {"a": [1,2,3,4],
     "b": [2,3,4,5],
     "c": [7,8,9,10]},
     index = [0,1,2,3])

df2 = pd.DataFrame(
    {"a": [0,2,3,5],
     "b": [12,3,4,15],
     "c": [17,18,19,110],
     "d": ['a','b','c','d']},
     index = [3,4,5,6]
    )

In [48]:
dfcombine = pd.concat([df1,df2],keys=['x','y'])
dfcombine.loc['x']

   a  b   c    d
0  1  2   7  NaN
1  2  3   8  NaN
2  3  4   9  NaN
3  4  5  10  NaN

In [65]:
## axis to determine rows (0) or columns (1) appending
## join to determine type based on index, inner for matched indices/columns, outer for all
dfcombine = pd.concat([df1,df2],axis=0,keys=['x','y'],join='outer')
dfcombine

     a   b    c    d
x 0  1   2    7  NaN
  1  2   3    8  NaN
  2  3   4    9  NaN
  3  4   5   10  NaN
y 3  0  12   17    a
  4  2   3   18    b
  5  3   4   19    c
  6  5  15  110    d

In [70]:
## Merge is SQL like joins
dfcombine2 = pd.merge(df1, df2, how='left', on=['a','b'] )
dfcombine2

   a  b  c_x   c_y    d
0  1  2    7   NaN  NaN
1  2  3    8  18.0    b
2  3  4    9  19.0    c
3  4  5   10   NaN  NaN

In [84]:
## lambda can iterate over a dataframe
dfcombine2.apply(lambda x: x['b']>3, axis=1)

0    False
1    False
2     True
3     True
dtype: bool

In [104]:

def checknum(num):
    if num < 3: 
        res = 'a'
    elif num < 5: 
        res = 'b'
    else: 
        res = 'o'
    return res


dfcombine2['newb'] = dfcombine2['b'].apply(lambda x: checknum(x))
dfcombine2

   a  b  c_x   c_y    d newb
0  1  2    7   NaN  NaN    a
1  2  3    8  18.0    b    b
2  3  4    9  19.0    c    b
3  4  5   10   NaN  NaN    o

### Aggregating Data
 - groupby
 - crosstab
 - pivottable

In [112]:
dfcomb3 = dfcombine2.groupby(['newb'])
dfcomb3.first()

dfcombine2.groupby(['newb']).a.mean()

newb
a    1.0
b    2.5
o    4.0
Name: a, dtype: float64

In [107]:
pd.crosstab(dfcombine2['d'],dfcombine2['newb'],margins=True)

newb  b  All
d
b     1    1
c     1    1
All   2    2

In [113]:
pd.pivot_table(dfcombine2, index=['newb','d'], values = "c_x", aggfunc=[min,max,np.mean])

        c_x
newb d
b    b    8
     c    9

## Matplotlib

### Data Visulization
#### Chart type
Line, Bar, Histogram, Box Plot, Violin Plot, Scatter Plot, Bubble Plot

In [149]:
# !pip3 install seaborn
# !pip3 install matplotlib

import matplotlib.pyplot as plt

In [137]:
%matplotlib inline

## Regular Expressions
To match specific patterns...
\d for numbers

In [124]:
import re
str = "Analytics Vidhya is the largest data science community of India"

#Check for the characters between a and g, in the above string
x = re.findall("[a-g]", str)
print(x)

['a', 'c', 'd', 'a', 'e', 'a', 'g', 'e', 'd', 'a', 'a', 'c', 'e', 'c', 'e', 'c', 'f', 'd', 'a']